app/views/pictures/index.html.erb

SELECT "pictures".* FROM "pictures" LIMIT 1
---
<h1>Zimbabwe in Pictures</h1>
<!-- show the first picture from the table which has been loaded by the Rails statement @first_pic = Picture.first in pictures_controller.rb -->