app/controllers/pictures_controller.rb

  def index
	if Picture.exists?
---
SELECT "pictures".* FROM "pictures" LIMIT 1

  def create
    @picture = Picture.new(params[:picture])

    respond_to do |format|
      if @picture.save
---
INSERT INTO "pictures" ("created_at", "description", "name", "updated_at", "url") VALUES (?, ?, ?, ?, ?)

  def update
    @picture = Picture.find(params[:id])

    respond_to do |format|
      if @picture.update_attributes(params[:picture])
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "pictures" SET "url" = 'pictures/images/buddie.jpg', "updated_at" = '2012-06-20 14:27:59.848171' WHERE "pictures"."id" = 1

  def destroy
    @picture = Picture.find(params[:id])
    @picture.destroy
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT 1  [["id", "5"]]
DELETE FROM "pictures" WHERE "pictures"."id" = ?  [["id", 5]]